#### Terraform Plan Output
   ```
   data.terraform_remote_state.fabric: Reading...
data.terraform_remote_state.fabric: Read complete after 1s
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_A"]: Refreshing state... [id=DmBzkfuQ3dCVxdfFMA]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_C"]: Refreshing state... [id=LWLhnRB7mH7sy4EMRA]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_B"]: Refreshing state... [id=zECuUAG4l4hpD1SCtA]
module.vpn_routing.apstra_datacenter_connectivity_template_interface.vpn: Refreshing state... [id=3cb88ba0-2bb7-11f0-9ae3-617073747261]
null_resource.force_redeploy: Refreshing state... [id=7836410129782299376]
apstra_blueprint_deployment.dc_1: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.force_redeploy must be replaced
-/+ resource "null_resource" "force_redeploy" {
      ~ id       = "7836410129782299376" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "fabric_staging_revision" = "33" -> (known after apply)
        }
    }

  # module.vpn_routing.data.apstra_blueprint_deployment.dc_1 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_blueprint_deployment" "dc_1" {
      + blueprint_id            = "4eefcfe6-87bb-4c79-a52d-b571266507c7"
      + comment                 = (known after apply)
      + has_uncommitted_changes = (known after apply)
      + revision_active         = (known after apply)
      + revision_staged         = (known after apply)
    }

  # module.vpn_routing.apstra_datacenter_connectivity_template_interface.vpn will be updated in-place
  ~ resource "apstra_datacenter_connectivity_template_interface" "vpn" {
      ~ description  = "includes routing policies for [Vendor_A, Vendor_B, Vendor_C]" -> "includes routing policies for [Vendor_A, Vendor_B, Vendor_C, Vendor_D]"
        id           = "3cb88ba0-2bb7-11f0-9ae3-617073747261"
      ~ ip_links     = {
          ~ "IP handoff to VPN router" = {
              ~ bgp_peering_ip_endpoints = {
                  ~ "BGP peering with VPN router" = {
                        id               = "815a0608-2bb7-11f0-94c8-617073747261"
                      ~ routing_policies = {
                          + "Vendor_D" = {
                              + id                = (known after apply)
                              + pipeline_id       = (known after apply)
                              + routing_policy_id = (known after apply)
                            },
                            # (3 unchanged elements hidden)
                        }
                        # (4 unchanged attributes hidden)
                    },
                }
                id                       = "3cb88c0e-2bb7-11f0-9ae3-617073747261"
                # (5 unchanged attributes hidden)
            },
        }
        name         = "IP+BGP handoff to VPN block"
        tags         = [
            "terraform",
            "test",
        ]
        # (1 unchanged attribute hidden)
    }

  # module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_D"] will be created
  + resource "apstra_datacenter_routing_policy" "vpn" {
      + blueprint_id        = "4eefcfe6-87bb-4c79-a52d-b571266507c7"
      + description         = "Vendor_D: Import count: 1 Export count: 3"
      + expect_default_ipv4 = true
      + expect_default_ipv6 = true
      + export_policy       = {
          + export_l2_edge_subnets        = false
          + export_l3_edge_server_links   = false
          + export_loopbacks              = false
          + export_spine_leaf_links       = false
          + export_spine_superspine_links = false
          + export_static_routes          = false
        }
      + extra_exports       = [
          + {
              + action = "permit"
              + prefix = "10.5.0.0/24"
            },
          + {
              + action = "permit"
              + prefix = "10.5.7.0/24"
            },
          + {
              + action = "permit"
              + prefix = "10.5.64.0/22"
            },
        ]
      + extra_imports       = [
          + {
              + action = "permit"
              + prefix = "172.19.0.0/24"
            },
        ]
      + id                  = (known after apply)
      + import_policy       = "extra_only"
      + name                = "Vendor_D"
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

   ```
   